## Plan Result (prod-sendgrid)




<pre><code>Plan: 140 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.access_management.azurerm_key_vault_secret.subuser
  * module.access_management.azurerm_key_vault_secret.subuser-api-key
  * module.access_management.random_password.password
  * module.access_management.sendgrid_api_key.subuser
  * module.access_management.sendgrid_domain_authentication.domain-authenticate[&#34;mail-am.platform.hmcts.net&#34;]
  * module.access_management.sendgrid_subuser.user
  * module.access_management_dns.azurerm_dns_cname_record.record1[&#34;mail-am.platform.hmcts.net&#34;]
  * module.access_management_dns.azurerm_dns_cname_record.record2[&#34;mail-am.platform.hmcts.net&#34;]
  * module.access_management_dns.azurerm_dns_cname_record.record3[&#34;mail-am.platform.hmcts.net&#34;]
  * module.adoption.azurerm_key_vault_secret.subuser
  * module.adoption.azurerm_key_vault_secret.subuser-api-key
  * module.adoption.random_password.password
  * module.adoption.sendgrid_api_key.subuser
  * module.adoption.sendgrid_domain_authentication.domain-authenticate[&#34;mail-adoption.platform.hmcts.net&#34;]
  * module.adoption.sendgrid_subuser.user
  * module.adoption_dns.azurerm_dns_cname_record.record1[&#34;mail-adoption.platform.hmcts.net&#34;]
  * module.adoption_dns.azurerm_dns_cname_record.record2[&#34;mail-adoption.platform.hmcts.net&#34;]
  * module.adoption_dns.azurerm_dns_cname_record.record3[&#34;mail-adoption.platform.hmcts.net&#34;]
  * module.civil.azurerm_key_vault_secret.subuser
  * module.civil.azurerm_key_vault_secret.subuser-api-key
  * module.civil.random_password.password
  * module.civil.sendgrid_api_key.subuser
  * module.civil.sendgrid_domain_authentication.domain-authenticate[&#34;mail-civil-prod.platform.hmcts.net&#34;]
  * module.civil.sendgrid_subuser.user
  * module.civil-dns.azurerm_dns_cname_record.record1[&#34;mail-civil-prod.platform.hmcts.net&#34;]
  * module.civil-dns.azurerm_dns_cname_record.record2[&#34;mail-civil-prod.platform.hmcts.net&#34;]
  * module.civil-dns.azurerm_dns_cname_record.record3[&#34;mail-civil-prod.platform.hmcts.net&#34;]
  * module.cmc.azurerm_key_vault_secret.subuser
  * module.cmc.azurerm_key_vault_secret.subuser-api-key
  * module.cmc.random_password.password
  * module.cmc.sendgrid_api_key.subuser
  * module.cmc.sendgrid_domain_authentication.domain-authenticate[&#34;mail-money-claims-prod.platform.hmcts.net&#34;]
  * module.cmc.sendgrid_subuser.user
  * module.cmc_dns.azurerm_dns_cname_record.record1[&#34;mail-money-claims-prod.platform.hmcts.net&#34;]
  * module.cmc_dns.azurerm_dns_cname_record.record2[&#34;mail-money-claims-prod.platform.hmcts.net&#34;]
  * module.cmc_dns.azurerm_dns_cname_record.record3[&#34;mail-money-claims-prod.platform.hmcts.net&#34;]
  * module.damages.azurerm_key_vault_secret.subuser
  * module.damages.azurerm_key_vault_secret.subuser-api-key
  * module.damages.random_password.password
  * module.damages.sendgrid_api_key.subuser
  * module.damages.sendgrid_domain_authentication.domain-authenticate[&#34;mail-damages.platform.hmcts.net&#34;]
  * module.damages.sendgrid_subuser.user
  * module.damages-dns.azurerm_dns_cname_record.record1[&#34;mail-damages.platform.hmcts.net&#34;]
  * module.damages-dns.azurerm_dns_cname_record.record2[&#34;mail-damages.platform.hmcts.net&#34;]
  * module.damages-dns.azurerm_dns_cname_record.record3[&#34;mail-damages.platform.hmcts.net&#34;]
  * module.db_reporting.azurerm_key_vault_secret.subuser
  * module.db_reporting.azurerm_key_vault_secret.subuser-api-key
  * module.db_reporting.random_password.password
  * module.db_reporting.sendgrid_api_key.subuser
  * module.db_reporting.sendgrid_domain_authentication.domain-authenticate[&#34;mail-db-reporting-prod.platform.hmcts.net&#34;]
  * module.db_reporting.sendgrid_subuser.user
  * module.db_reporting_dns.azurerm_dns_cname_record.record1[&#34;mail-db-reporting-prod.platform.hmcts.net&#34;]
  * module.db_reporting_dns.azurerm_dns_cname_record.record2[&#34;mail-db-reporting-prod.platform.hmcts.net&#34;]
  * module.db_reporting_dns.azurerm_dns_cname_record.record3[&#34;mail-db-reporting-prod.platform.hmcts.net&#34;]
  * module.dcs.azurerm_key_vault_secret.subuser
  * module.dcs.azurerm_key_vault_secret.subuser-api-key
  * module.dcs.random_password.password
  * module.dcs.sendgrid_api_key.subuser
  * module.dcs.sendgrid_domain_authentication.domain-authenticate[&#34;mail-dcs.platform.hmcts.net&#34;]
  * module.dcs.sendgrid_subuser.user
  * module.dcs-dns.azurerm_dns_cname_record.record1[&#34;mail-dcs.platform.hmcts.net&#34;]
  * module.dcs-dns.azurerm_dns_cname_record.record2[&#34;mail-dcs.platform.hmcts.net&#34;]
  * module.dcs-dns.azurerm_dns_cname_record.record3[&#34;mail-dcs.platform.hmcts.net&#34;]
  * module.divorce.azurerm_key_vault_secret.subuser
  * module.divorce.azurerm_key_vault_secret.subuser-api-key
  * module.divorce.random_password.password
  * module.divorce.sendgrid_api_key.subuser
  * module.divorce.sendgrid_domain_authentication.domain-authenticate[&#34;mail-divorce.platform.hmcts.net&#34;]
  * module.divorce.sendgrid_subuser.user
  * module.divorce_dns.azurerm_dns_cname_record.record1[&#34;mail-divorce.platform.hmcts.net&#34;]
  * module.divorce_dns.azurerm_dns_cname_record.record2[&#34;mail-divorce.platform.hmcts.net&#34;]
  * module.divorce_dns.azurerm_dns_cname_record.record3[&#34;mail-divorce.platform.hmcts.net&#34;]
  * module.employment_tribunals.azurerm_key_vault_secret.subuser
  * module.employment_tribunals.azurerm_key_vault_secret.subuser-api-key
  * module.employment_tribunals.random_password.password
  * module.employment_tribunals.sendgrid_api_key.subuser
  * module.employment_tribunals.sendgrid_domain_authentication.domain-authenticate[&#34;employmenttribunals.service.gov.uk&#34;]
  * module.employment_tribunals.sendgrid_subuser.user
  * module.employment_tribunals_dns.azurerm_dns_cname_record.record1[&#34;employmenttribunals.service.gov.uk&#34;]
  * module.employment_tribunals_dns.azurerm_dns_cname_record.record2[&#34;employmenttribunals.service.gov.uk&#34;]
  * module.employment_tribunals_dns.azurerm_dns_cname_record.record3[&#34;employmenttribunals.service.gov.uk&#34;]
  * module.nessus.azurerm_key_vault_secret.subuser
  * module.nessus.azurerm_key_vault_secret.subuser-api-key
  * module.nessus.random_password.password
  * module.nessus.sendgrid_api_key.subuser
  * module.nessus.sendgrid_domain_authentication.domain-authenticate[&#34;mail-nessus.platform.hmcts.net&#34;]
  * module.nessus.sendgrid_subuser.user
  * module.nessus-dns.azurerm_dns_cname_record.record1[&#34;mail-nessus.platform.hmcts.net&#34;]
  * module.nessus-dns.azurerm_dns_cname_record.record2[&#34;mail-nessus.platform.hmcts.net&#34;]
  * module.nessus-dns.azurerm_dns_cname_record.record3[&#34;mail-nessus.platform.hmcts.net&#34;]
  * module.panorama.azurerm_key_vault_secret.subuser
  * module.panorama.azurerm_key_vault_secret.subuser-api-key
  * module.panorama.random_password.password
  * module.panorama.sendgrid_api_key.subuser
  * module.panorama.sendgrid_domain_authentication.domain-authenticate[&#34;mail-panorama.platform.hmcts.net&#34;]
  * module.panorama.sendgrid_subuser.user
  * module.panorama-dns.azurerm_dns_cname_record.record1[&#34;mail-panorama.platform.hmcts.net&#34;]
  * module.panorama-dns.azurerm_dns_cname_record.record2[&#34;mail-panorama.platform.hmcts.net&#34;]
  * module.panorama-dns.azurerm_dns_cname_record.record3[&#34;mail-panorama.platform.hmcts.net&#34;]
  * module.payment.azurerm_key_vault_secret.subuser
  * module.payment.azurerm_key_vault_secret.subuser-api-key
  * module.payment.random_password.password
  * module.payment.sendgrid_api_key.subuser
  * module.payment.sendgrid_domain_authentication.domain-authenticate[&#34;mail-payment.platform.hmcts.net&#34;]
  * module.payment.sendgrid_subuser.user
  * module.payment_dns.azurerm_dns_cname_record.record1[&#34;mail-payment.platform.hmcts.net&#34;]
  * module.payment_dns.azurerm_dns_cname_record.record2[&#34;mail-payment.platform.hmcts.net&#34;]
  * module.payment_dns.azurerm_dns_cname_record.record3[&#34;mail-payment.platform.hmcts.net&#34;]
  * module.pcol.azurerm_key_vault_secret.subuser
  * module.pcol.azurerm_key_vault_secret.subuser-api-key
  * module.pcol.random_password.password
  * module.pcol.sendgrid_api_key.subuser
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol.sendgrid_subuser.user
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]
  * module.private_law.azurerm_key_vault_secret.subuser
  * module.private_law.azurerm_key_vault_secret.subuser-api-key
  * module.private_law.random_password.password
  * module.private_law.sendgrid_api_key.subuser
  * module.private_law.sendgrid_domain_authentication.domain-authenticate[&#34;mail-prl.platform.hmcts.net&#34;]
  * module.private_law.sendgrid_subuser.user
  * module.private_law_dns.azurerm_dns_cname_record.record1[&#34;mail-prl.platform.hmcts.net&#34;]
  * module.private_law_dns.azurerm_dns_cname_record.record2[&#34;mail-prl.platform.hmcts.net&#34;]
  * module.private_law_dns.azurerm_dns_cname_record.record3[&#34;mail-prl.platform.hmcts.net&#34;]
  * module.reference_data.azurerm_key_vault_secret.subuser
  * module.reference_data.azurerm_key_vault_secret.subuser-api-key
  * module.reference_data.random_password.password
  * module.reference_data.sendgrid_api_key.subuser
  * module.reference_data.sendgrid_domain_authentication.domain-authenticate[&#34;mail-rd.platform.hmcts.net&#34;]
  * module.reference_data.sendgrid_subuser.user
  * module.reference_data_dns.azurerm_dns_cname_record.record1[&#34;mail-rd.platform.hmcts.net&#34;]
  * module.reference_data_dns.azurerm_dns_cname_record.record2[&#34;mail-rd.platform.hmcts.net&#34;]
  * module.reference_data_dns.azurerm_dns_cname_record.record3[&#34;mail-rd.platform.hmcts.net&#34;]
  * module.sscs.azurerm_key_vault_secret.subuser
  * module.sscs.azurerm_key_vault_secret.subuser-api-key
  * module.sscs.random_password.password
  * module.sscs.sendgrid_api_key.subuser
  * module.sscs.sendgrid_subuser.user




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.access_management.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-access-management-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.access_management.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-access-management-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.access_management.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.access_management.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "access-management-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.access_management.sendgrid_domain_authentication.domain-authenticate["mail-am.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-am.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.access_management.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-access-management-prod"
    }

  # module.access_management_dns.azurerm_dns_cname_record.record1["mail-am.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.access_management_dns.azurerm_dns_cname_record.record2["mail-am.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.access_management_dns.azurerm_dns_cname_record.record3["mail-am.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.adoption.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-adoption-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.adoption.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-adoption-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.adoption.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.adoption.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "adoption-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.adoption.sendgrid_domain_authentication.domain-authenticate["mail-adoption.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-adoption.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.adoption.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-adoption-prod"
    }

  # module.adoption_dns.azurerm_dns_cname_record.record1["mail-adoption.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.adoption_dns.azurerm_dns_cname_record.record2["mail-adoption.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.adoption_dns.azurerm_dns_cname_record.record3["mail-adoption.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.civil.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-civil-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.civil.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-civil-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.civil.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.civil.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "civil-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.civil.sendgrid_domain_authentication.domain-authenticate["mail-civil-prod.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-civil-prod.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.civil.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-civil-prod"
    }

  # module.civil-dns.azurerm_dns_cname_record.record1["mail-civil-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.civil-dns.azurerm_dns_cname_record.record2["mail-civil-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.civil-dns.azurerm_dns_cname_record.record3["mail-civil-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.cmc.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-cmc-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cmc.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-cmc-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cmc.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.cmc.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "cmc-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.cmc.sendgrid_domain_authentication.domain-authenticate["mail-money-claims-prod.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-money-claims-prod.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.cmc.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-cmc-prod"
    }

  # module.cmc_dns.azurerm_dns_cname_record.record1["mail-money-claims-prod.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.cmc_dns.azurerm_dns_cname_record.record2["mail-money-claims-prod.platf

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

    = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.payment_dns.azurerm_dns_cname_record.record2["mail-payment.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.payment_dns.azurerm_dns_cname_record.record3["mail-payment.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.pcol.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-pcol-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.pcol.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-pcol-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.pcol.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.pcol.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "pcol-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security   = true
      + custom_dkim_selector = "prd"
      + dns                  = (known after apply)
      + domain               = "hmcts.net"
      + id                   = (known after apply)
      + ips                  = (known after apply)
      + is_default           = true
      + subdomain            = (known after apply)
      + username             = (known after apply)
      + valid                = (known after apply)
    }

  # module.pcol.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-pcol-prod"
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "hmcts.net"
    }

  # module.private_law.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-private-law-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.private_law.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-private-law-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.private_law.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.private_law.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "private-law-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.private_law.sendgrid_domain_authentication.domain-authenticate["mail-prl.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-prl.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.private_law.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-private-law-prod"
    }

  # module.private_law_dns.azurerm_dns_cname_record.record1["mail-prl.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.private_law_dns.azurerm_dns_cname_record.record2["mail-prl.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.private_law_dns.azurerm_dns_cname_record.record3["mail-prl.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.reference_data.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-reference-data-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.reference_data.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-reference-data-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.reference_data.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.reference_data.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "reference-data-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.reference_data.sendgrid_domain_authentication.domain-authenticate["mail-rd.platform.hmcts.net"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "mail-rd.platform.hmcts.net"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.reference_data.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-reference-data-prod"
    }

  # module.reference_data_dns.azurerm_dns_cname_record.record1["mail-rd.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.reference_data_dns.azurerm_dns_cname_record.record2["mail-rd.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.reference_data_dns.azurerm_dns_cname_record.record3["mail-rd.platform.hmcts.net"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.sscs.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-sscs-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sscs.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-sscs-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sscs.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.sscs.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "sscs-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.sscs.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-sscs-prod"
    }

Plan: 140 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":59,"Program":"tfcmt","SHA1":"","Target":"prod-sendgrid","Vars":{}} -->